# IsRevisionIssued Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionCloud..::..IsRevisionIssued Method
RevisionCloud Class See Also
---
Indicates whether the Revision associated with this RevisionCloud has been issued.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsRevisionIssued()
```

Visual Basic
---
```text
Public Function IsRevisionIssued As Boolean
```

Visual C++
---
```text
public:
bool IsRevisionIssued()
```

# ### Return Value
True if the Revision has been issued, False otherwise.
# See Also
RevisionCloud Class
Autodesk.Revit.DB Namespace